Revit 2027 API
StructuralInstanceUsageFilter Constructor
Overload List
Name | Description
StructuralInstanceUsageFilter(StructuralInstanceUsage) |  Constructs a new instance of a filter to match structural family instances (typically columns, beams, or braces) of the given structural usage.
StructuralInstanceUsageFilter(StructuralInstanceUsage, Boolean) |  Constructs a new instance of a filter to match family instances by structural usage, with the option to match all family instances which are not of the given structural usage.
Top
See Also
Reference
StructuralInstanceUsageFilter Class
Autodesk.Revit.DB.Structure Namespace